       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAJERO.
       DATE-WRITTEN. 2025-08-05.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
                   
              DISPLAY "Bienvenido al cajero automático".
           STOP RUN.
           